In [1]:
# inport the pandas library for data manipulation
import pandas as pd

# load the dataset 
df = pd.read_csv("D:/datasets/salaries.csv")
df.head()

  country                  job     degree  salary_more_than_100K
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [3]:
df['country'].head()
df['salary_more_than_100K'].head()

0    0
1    0
2    1
3    1
4    0
Name: salary_more_than_100K, dtype: int64

In [4]:
df.head()

  country                  job     degree  salary_more_than_100K
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [5]:
# independent variable 
input_value = df[['country','job','degree']]

# dependent variable
output_value = df[['salary_more_than_100K']]

In [6]:
input_value

       country                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [7]:
output_value

    salary_more_than_100K
0                       0
1                       0
2                       1
3                       1
4                       0
5                       1
6                       0
7                       0
8                       0
9                       1
10                      1
11                      1
12                      1
13                      1
14                      1
15                      1

In [8]:
from sklearn.preprocessing import LabelEncoder

In [9]:
# renaming the columns from country to company
input_value.rename(columns={'country':'company'},inplace=True)

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_10904\2614517197.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  input_value.rename(columns={'country':'company'},inplace=True)

In [10]:
input_value.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [13]:
# changing the categorical value to numeric value
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [14]:
input_value['company_new'] = le_company.fit_transform(input_value['company'])
input_value['job_new'] = le_job.fit_transform(input_value['job'])
input_value['degree_new'] = le_degree.fit_transform(input_value['degree'])

In [15]:
input_value

,company,job,degree,company_new,job_new,degree_new
0,google,sales executive,bachelors,2,2,0
1,google,sales executive,masters,2,2,1
2,google,business manager,bachelors,2,0,0
3,google,business manager,masters,2,0,1
4,google,computer programmer,bachelors,2,1,0
5,google,computer programmer,masters,2,1,1
6,abc pharma,sales executive,masters,0,2,1
7,abc pharma,computer programmer,bachelors,0,1,0
8,abc pharma,business manager,bachelors,0,0,0
9,abc pharma,business manager,masters,0,0,1
10,facebook,sales executive,bachelors,1,2,0
11,facebook,sales executive,masters,1,2,1
12,facebook,business manager,bachelors,1,0,0
13,facebook,business manager,masters,1,0,1
14,facebook,computer programmer,bachelors,1,1,0
15,facebook,computer programmer,masters,1,1,1

In [16]:
# create new dataframe variable to store only numerical value of the corresponding categorical value
input_new = input_value.drop(['company','job','degree'],axis=1)
input_new.head()

   company_new  job_new  degree_new
0            2        2           0
1            2        2           1
2            2        0           0
3            2        0           1
4            2        1           0

In [17]:
from sklearn import tree

In [18]:
model = tree.DecisionTreeClassifier()

In [20]:
model.fit(input_new,output_value)

DecisionTreeClassifier()

 the model has been created and it is ready to predict the value

In [21]:
model.score(input_new,output_value)

1.0

for company = {
                0:abc pharma,
                1:facebook,
                2:google
                }
                
for job = {
               0:business manager,
               1:computer programme,
               2:sales executive
               }
               
for degree = { 
               0:bachelors,
               1:masters
               }
            
our target is to find whether the person will earn more than 100K where 0:'NO' and 1:'YES'

In [23]:
# wheather a person who work for google:2 and whose job is sales executive:2 with a masters:1 degree earn more than 100K or not?
model.predict([[2,2,1]])

C:\Users\Lenovo\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0], dtype=int64)

the output is 0 i.e he/she doesn't earn more than 100k

In [31]:
!cowsay("thank you")

  ___________
| (thank you) |
  ===========
           \
            \
              ^__^
              (oo)\_______
              (__)\       )\/\
                  ||----w |
                  ||     ||